import AtricleViewer from '@/components/HomePage/AtricleViewer';

const str = `

记录一下关于个人发展未来的几点想法。

## 1. 职业关系：

### 1.1 职业定位：

资深全栈工程师，前端领域专家，架构专家。

### 1.2 实力偏向：

5G发展，是互联网行业发展的下一个高潮点，对未来保持思考，有一定的预见能力，学着做一个聪明人。

网络通讯技术的革命性变化必然会带动社会各个行业的革命性变化。 短短十年，从2G - 4G ， 有太多的未知和可能。即将到来的4G - 5G 是下一个爆发点。 预先储备爆发点带来的市场所需技能，具有洞察力的行业准备，是非常重要的。

对于职业发展，我会从两个方向去考虑：

#### 1.2.1 行业

在大互联网环境下，技术分支越来越多，专业越来越深精。如火如茶的AI，机器智能化，5G 浪尖上的工业智能化，Iot等等。明确哪个行业适合自己发展，至少应该考虑以下几个基本维度：

- 是否适合？ 
- 兴趣度如何？
- 对工作年限是什么期望？

要是以前，要我谈到兴趣，对于我来说是有一些痛苦的。特别是对我这种没有明显可行，贴近现实情况的兴趣。 刚毕业的时候，记得还是挺有意思的。 大学将毕业的时候，我找到属于自己的一套定位方法。

> a. 拿一张纸，写下两个一级分类： 专业相关，专业不相关b. 然后在一级分类下去明细，和专业相关的应该好列出来，然后是专业不相关的二级分类（列什么的依据就是你能想到什么列什么），我记得最后我的专业不相关分类好像就三四个：老师、考公务员、计算机、外贸...c. 依据综合因素（凭着抽象直觉），思考之后，排除掉暂时不想考虑的二级类别。 像我最后好像就只剩下计算机和外贸，还有一个专业的弱电方向。我排了个序： 外贸 > 计算机 > 专业相关 d. 开始找工作了，然后我就到了这家传统制造企业的开发部门。

但是讲真的。我其实觉得人生皆苦，其实要真的让我选，我希望躺着就能赚钱 。兴趣不兴趣，对于这个阶段的我来讲，我的认知很简单庸俗。 我先要考虑我毕业怎么才能生活下去，然后是在此基础之上对比发掘出自己最愿意将就的。

将近两年的跨专业从业，平常工作用到的技术栈基本都是前端相关。 我从最初2个月难到想辞职回家找培训，到现在能独立完成大部分工作任务。其实怎么讲呢，单纯的从自我心境上去考虑其实还是挺开心的。因为能看到自己的变化和成长，项目完成上线后有好的反馈。 有一种实现价值的喜悦。

从行业发展上看，最大的特点就是技术更新换代快，需要不断的学习。 这个特点是双面的，不好的地方就是，面对完成工作和个人技能提升，时常需要兼顾完成工作的同时，还要抽出大块大块的时间去系统学习很多东西，相当的耗神，废脑。好的地方就是，其实并不是所有行业都能有像计算机行业一样，只要你想学，你总能接触到新的技术，挺有意思，此外能保持你的思考能力。

从社会生存角度来讲，和计算机打交道，有的时候，比和人打交道要简单的多。 像我这种不善于交际，也疲于表面关系处理的人来讲，像是救命一样。 这可能是技术行业的特性吧。

#### 1.2.2 定位

我觉得，思考自己能在一个行业中，达到什么水平，能不能到上游，是一个绝对关键的问题。 考量的指标也简单，就是 "天花板" ， 一个是行业的天花板， 一个是个人的天花板。天花板的定义其实也是多维度的，从主要的几个纬度考虑，应该不限于职位，薪资，规模等。社会金字塔模型是适用的。行业天花板决定了你未来能够攀爬的高度，个人的天花板则基本可以表征你未来职业生涯能够达到的高度。 说的直白一点，它象征了你能达到一个什么样的工资水平。

互联网行业，出于年龄特性，可能会在一定年纪到达分水岭，甚至断崖。 但是有一点不会改变的，就是技术能力水平。 不论你以后是转型，还是继续做技术，技术永远是第一核心竞争力。

定位的考虑，应该是理性，切合自身条件，有实际实现意义的。互联网行业就业者，大牛一般可以按照优势特点分为两类：智力优势、经验优势。

- **智力优势**

  这个优势的体现，主要在那群搞AI，机器学习，图形等偏重算法的领域，大量的高阶算法实际运用能力，甚至创造新的算法。 对理工科学素质能力比较高，说白了，脑细胞多并且活跃的人才干的了，普通人就是折磨。

- **经验优势**

  这个优势也是大部分人想要成文技术大牛的主要策略。非算法岗位，大多数都是这样的。 例如运维，普通的前后端业务开发，当一切东西流程化了之后，规范化了之后，解决的问题多了，其实都变成了不那么消耗智力的工作。 （所谓消耗智力的工作，是仅凭个人，花了很多时间还不能或者是很难通过思考解决遇到的问题的工作。 就想有的人，同一个算法，看两遍就理解了并且能运用，但是有的人怎么都理解不了。 这就很难通过经验去解决。），即便是UX交互设计，这种偏向创新的工作，也可以流程化，技术化。 学习也会成为经验。

从我个人角度思考，肯定是按照经验优势的策略去发展，全栈发展定位，侧重前端技术。 成为前端技术领域专家。 5G时代，当数据不在受制于带宽， 必定会使得前端有更多更加创新的可能。未来，一定是性能过剩的时代。WebGl, 前端AR, 甚至VR， 都可能和前端技术对接。

### 1.3 风险对抗

所谓风险对抗，主要是指两方面，一个是面向当下，一个是面向未来。

**从当下来说，工资待遇如何提高，以及当下公司发展和岗位，是否符合自己的未来预期线路？**

什么情况下，工资才能合理增长？

- 技术能力提升，担任职业角色更加重要，承担职业责任越多
- 同岗位待遇低于当地市场水平

所以，所谓的当下风险对抗，实际上就是怎么升职，因为只有升职，才能让你升值。是你个人能力进步的外部体现。 迟迟停滞不前，就是退步，为什么不会有更年轻的人，能力更强的人取代你现在的位置？

**面对未来，怎么找到更好的下一份工作，以及如何应对失业风险？**

其实，这个方面的考虑，具体讲，应该是，下一份工作**凭借什么**找到更好的？

- 技术能力
- 经验
- 证书证明，资质证明
- 软实力

所以，不论是在当下，还是面向未来，站在宏观角度看问题，都是重要的。 更加强的技术能力，是最硬的敲门砖。 证书，经验等都是辅佐证明自己的技术能力。是别人能直接看到的东西，别人有，你也有；别人能；你也能。 这并不能体现你太大的价值，而是你有，别人不一定有；你能，别人不一定能。 才能体现出你的价值。

证书，其实不仅仅是敲门砖。 更加重要的，证书会刺激你去学习一个技术。成为敲门砖，只是顺带的事。

 

## 2. 非职业关系：

非职业关系的东西太多了，二十多岁恰逢过半的年纪，有太多的事情想做。不打算细细说明，大概列一列，时不时提醒自己念着吧。然后慢慢去适当安排。该提上计划的提上计划，该提上日程的提上日程。

- 摄影

  我也没有想到摄影会成为我第一个想到的事情。 以前都是自己拿个手机瞎拍，也拍不出啥自己满意的东西。 经常看见别人超美的作品看半天。系统学习摄影知识，攒钱买台相机。

   

- 英语

  工作以来，越来越深知英语的重要性。其实我不仅仅想只是停留在读写上。我想英文作为自己真正无障碍交流的工具，这样就能方便自己实现其他的计划了。心心念的雅思，害怕又很想考了。也应该好好计划下明年看能不能考掉了。

   

- 去国外待两年

  想去国外工作工作，单纯的想看看外面的世界。外企好像对程序员更加友好一些，欧美国家互联网从业人员在劳务人员从业比例中占2-3%， 而国内1.5%都不到，也不知道为什么国内会内卷的这么厉害。

   

- 健身

  拥有更好的体魄，让自己自信一些，成为自己都喜欢的样子总不会有错。

   

- 戒烟

  慢慢把烟戒掉，爱自己，爱家人，爱未来。 没有生病的资本。

   

- 山河

  想多旅游，多拍照片，多见识自然浩瀚。多看看祖国河山。想计划性带着父母旅旅游。年纪大了，苦累了一辈子了。让他们休息休息。

   

- 涵养

  学学管理，学学投资理财，保持了解通识类知识。了解一些历史，能聊得来几句辞赋。不仅仅是增加自己的学识，能够提高人格魅力，最重要的，是增加自己的格局，思想高度和维度。 还有副业，打工人是不可能占据高地的！

   

- 修生性

  修生养性，少一些戾气，多一点宽容和谦卑。
`;

const str1 = `
最近在马不停蹄的学习RHCE，学习过程中，我发现很多情况下。存在这样的一个现象：
直接看书的时候，如果某章节内容并不是很友好的，非常有设计，合理的介绍一个全新的概念，内容。
那么在学习的时候，非常难开始，因为看书总有一种这样的心理准备，看不懂前面的，后面的就肯定看不懂了。
实际上大部分内容也确实是这样。 但是这样有一个最大的问题，就是效率低下。
暂时没看懂的原因其实是多种的，例如状态不好，书实在是写的晦涩，不够合理和循序渐进，技术类书籍大多是译版，很多本身很简单的含义时常被扭曲。

![image](http://placeimg.com/640/480/abstract)


然后我发现，在看视频去学习一个全新的内容的时候，有时候，也会这样，开始有些模糊，但是一旦到中间，或者后面。 
老师写出示例，或者给出比较有总结性的图，或者结构性的内容。我发现很多时候就会恍然大悟。 

所以，我觉得，如果是想要高效的学习，别人的讲述，是携带着既有的经验。踩过的坑，哪里不好理解，别人都知道。 
所以会侧重的讲解。 这是很好的方式，与其说，单一的通过书籍学习。  或者更应该总结为，通过多维度的信息渠道
帮助自己获取，归纳，总结信息，应该是更加合理的学习方式。 老师通过课件，示例，讲解 就是多维度的。 

当对知识有一个大体的框架了，想要仔细的学习，这时候，通过书籍，可以帮助自己梳理。因为心中已经对知识有一个大体的
框架了。就算是一本全新的书，拿到也会有一种熟悉感。 并不会担心哪里每看仔细，对后面有什么影响。 
孰有轻重，自己是知道的。梳理过之后，多几次，心中才不会感到对知识掌握空洞，不自信。`;
const HomeRecentPosts: React.FC<StandardProps> = (props) => {
  return (
    <div
      {...props}
      className="grid grid-rows-[repeat(8,12rem)] gap-2 whitespace-pre-line sm:grid-rows-[repeat(12,12rem)]   md:grid-cols-6 lg:grid-cols-12"
    >
      {/* 1 版 */}

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str}
        className="
      [column-rule-style:solid] [grid-row:1/3]  [column-rule-width:1px] [column-rule-color:#e2e8f0]
      dark:[column-rule-color:#475569]
      sm:columns-2
      md:[grid-column:1/5]
      md:[grid-row:1/5]
      lg:[grid-column:1/9]
      lg:[grid-row:1/5]
      "
      />

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className="  
      [grid-row:3/5]
      md:[grid-row:1/5]
      md:[grid-column:5/7]
      lg:[grid-row:1/5] 
      lg:[grid-column:9/13]
    "
      />

      {/* 2 版 */}

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className=" 
      [column-rule-style:solid] [grid-row:5/7]  [column-rule-width:1px] [column-rule-color:#e2e8f0]
      dark:[column-rule-color:#475569]
      sm:columns-4
      md:[grid-column:1/7]
      md:[grid-row:5/8]
      lg:[grid-row:5/8] 
      lg:[grid-column:1/13]
    "
      />

      {/* 3 版 */}

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className="
      [column-rule-style:solid] [grid-row:7/9]  [column-rule-width:1px] [column-rule-color:#e2e8f0]
      dark:[column-rule-color:#475569]
      sm:columns-4
      md:[grid-column:1/7]
      md:[grid-row:8/10]
      lg:[grid-column:1/13] 
      lg:[grid-row:8/10]
    "
      />

      {/* 4 版 */}

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className=" 
      hidden
      sm:block
      md:[grid-column:1/3]
      md:[grid-row:10/13]              
      lg:[grid-column:1/5] 
      lg:[grid-row:10/13]
    "
      />

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className="
      hidden
      sm:block
      md:[grid-row:10/13]
      md:[grid-column:3/5]
      lg:[grid-column:5/9] 
      lg:[grid-row:10/13]
    "
      />

      <AtricleViewer
        title="这是一个标题"
        description="这是一段描述文本，Lorem ipsum dolor sit amet consectetur adipisicing
        elit. Quisquam, soluta!"
        content={str1}
        className=" 
      hidden
      sm:block
      md:[grid-column:5/7]
      md:[grid-row:10/13]
      lg:[grid-column:9/13] 
      lg:[grid-row:10/13]
    "
      />
    </div>
  );
};
export default HomeRecentPosts;
